Revit 2024 API
UIView Properties
The UIView type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ViewId
 The id of the View associated with a UIView.
See Also
UIView Class
Autodesk.Revit.UI Namespace